-- MySQL dump 10.13  Distrib 8.0.42, for Win64 (x86_64)
--
-- Host: localhost    Database: testdata
-- ------------------------------------------------------
-- Server version	8.0.42

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `test_products`
--

DROP TABLE IF EXISTS `test_products`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `test_products` (
  `id_test_products` int NOT NULL,
  `category` varchar(45) NOT NULL,
  `seller_id` varchar(45) NOT NULL,
  `title` varchar(45) NOT NULL,
  `price` varchar(45) NOT NULL,
  `created_at` timestamp NOT NULL,
  `sell_date` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id_test_products`),
  KEY `user_id_idx` (`seller_id`),
  CONSTRAINT `user_id` FOREIGN KEY (`seller_id`) REFERENCES `test_user` (`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='테스트 상품 테이블\n데이터 분석에 필요한 요소만 넣음(상품설명, url 삭제)\n현재 상품의 상태가 변할 경우(판매중, 숨김, 판매완료), 키워드 문제로 인해\n자식 DB를 추가하거나, 컬럼을 추가해야 할 것 같음';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `test_products`
--

LOCK TABLES `test_products` WRITE;
/*!40000 ALTER TABLE `test_products` DISABLE KEYS */;
INSERT INTO `test_products` VALUES (1,'전자기기','ryan18','태블릿 거치대','100821','2025-01-09 15:00:00','2025-01-16 15:00:00'),(2,'전자기기','carol03','스마트워치','74036','2025-02-20 15:00:00',NULL),(3,'주방용품','jack10','식기 세트','23872','2025-10-13 15:00:00','2025-11-11 15:00:00'),(4,'가구','carol03','원목 책상','131954','2024-12-11 15:00:00',NULL),(5,'주방용품','felix06','식기 세트','141475','2024-08-07 15:00:00','2024-09-14 15:00:00'),(6,'가구','carol03','원목 책상','79976','2025-02-26 15:00:00','2025-03-30 15:00:00'),(7,'가구','elena05','서랍장','78617','2025-02-25 15:00:00','2025-04-14 15:00:00'),(8,'생활용품','carol03','수납함 세트','107656','2024-09-06 15:00:00','2024-10-18 15:00:00'),(9,'의류','henry08','운동화','99384','2025-04-07 15:00:00',NULL),(10,'가전제품','sofia19','헤어드라이기','29600','2025-04-18 15:00:00','2025-07-06 15:00:00'),(11,'주방용품','sofia19','프라이팬 세트','17141','2025-02-08 15:00:00','2025-03-30 15:00:00'),(12,'가전제품','alice01','헤어드라이기','105599','2024-09-09 15:00:00',NULL),(13,'가구','grace07','원목 책상','123004','2024-12-21 15:00:00','2025-03-09 15:00:00'),(14,'의류','alice01','겨울 패딩','81750','2024-12-29 15:00:00','2025-03-02 15:00:00'),(15,'주방용품','felix06','식기 세트','133266','2024-07-19 15:00:00','2024-08-09 15:00:00'),(16,'주방용품','brian02','프라이팬 세트','16369','2025-11-22 15:00:00',NULL),(17,'가전제품','karen11','스팀다리미','59708','2025-08-20 15:00:00','2025-09-09 15:00:00'),(18,'생활용품','olivia15','수납함 세트','82224','2025-02-06 15:00:00',NULL),(19,'주방용품','ryan18','식기 세트','95981','2024-12-01 15:00:00','2025-01-31 15:00:00'),(20,'전자기기','irene09','스마트워치','68740','2025-01-24 15:00:00','2025-03-24 15:00:00'),(21,'가구','leo12','접이식 의자','32281','2025-01-31 15:00:00',NULL),(22,'가전제품','elena05','스팀다리미','131387','2025-03-04 15:00:00',NULL),(23,'가전제품','elena05','스팀다리미','42074','2025-03-18 15:00:00','2025-06-08 15:00:00'),(24,'주방용품','elena05','프라이팬 세트','55539','2025-01-04 15:00:00','2025-03-26 15:00:00'),(25,'가구','leo12','접이식 의자','95719','2025-01-12 15:00:00','2025-02-09 15:00:00'),(26,'주방용품','carol03','커피 드리퍼','42395','2024-11-18 15:00:00','2025-01-23 15:00:00'),(27,'생활용품','brian02','공기청정기 필터','93862','2025-11-01 15:00:00',NULL),(28,'가전제품','brian02','스팀다리미','148584','2025-09-19 15:00:00','2025-12-17 15:00:00'),(29,'생활용품','karen11','공기청정기 필터','145323','2025-03-22 15:00:00',NULL),(30,'의류','carol03','겨울 패딩','146509','2024-11-16 15:00:00','2025-01-29 15:00:00'),(31,'전자기기','leo12','태블릿 거치대','15641','2024-12-18 15:00:00','2025-03-07 15:00:00'),(32,'주방용품','peter16','프라이팬 세트','60524','2025-01-31 15:00:00','2025-03-05 15:00:00'),(33,'생활용품','mia13','공기청정기 필터','73021','2024-10-15 15:00:00','2024-11-11 15:00:00'),(34,'가구','olivia15','접이식 의자','102112','2024-12-31 15:00:00','2025-03-09 15:00:00'),(35,'가구','ryan18','접이식 의자','97081','2025-01-24 15:00:00','2025-04-03 15:00:00'),(36,'가전제품','derek04','스팀다리미','68287','2025-05-28 15:00:00',NULL),(37,'생활용품','ryan18','욕실 수납장','85874','2025-01-09 15:00:00',NULL),(38,'가구','mia13','원목 책상','125959','2024-12-01 15:00:00','2025-02-19 15:00:00'),(39,'의류','olivia15','남성 청바지','133080','2024-11-15 15:00:00','2025-02-04 15:00:00'),(40,'주방용품','ryan18','식기 세트','120118','2025-03-27 15:00:00','2025-04-09 15:00:00'),(41,'가구','sofia19','접이식 의자','71645','2025-05-03 15:00:00','2025-07-26 15:00:00'),(42,'가전제품','derek04','헤어드라이기','109062','2025-06-08 15:00:00',NULL),(43,'전자기기','tom20','블루투스 이어폰','89868','2025-03-17 15:00:00','2025-04-07 15:00:00'),(44,'전자기기','derek04','스마트워치','101794','2025-02-17 15:00:00','2025-04-20 15:00:00'),(45,'전자기기','alice01','노트북 가방','85936','2024-12-23 15:00:00','2025-01-15 15:00:00'),(46,'전자기기','derek04','USB 충전기','87632','2025-03-24 15:00:00','2025-04-17 15:00:00'),(47,'가전제품','tom20','스팀다리미','38817','2025-03-31 15:00:00',NULL),(48,'의류','noah14','겨울 패딩','34443','2025-11-01 15:00:00','2025-12-03 15:00:00'),(49,'가전제품','grace07','헤어드라이기','10286','2025-03-19 15:00:00','2025-03-25 15:00:00'),(50,'주방용품','derek04','세라믹 냄비','60423','2025-02-17 15:00:00','2025-05-12 15:00:00'),(51,'생활용품','irene09','수납함 세트','21366','2025-01-07 15:00:00','2025-02-24 15:00:00'),(52,'의류','jack10','남성 청바지','139375','2025-09-12 15:00:00','2025-12-10 15:00:00'),(53,'가전제품','tom20','스팀다리미','119261','2025-02-25 15:00:00','2025-04-06 15:00:00'),(54,'주방용품','elena05','커피 드리퍼','17106','2025-01-25 15:00:00','2025-03-20 15:00:00'),(55,'주방용품','mia13','프라이팬 세트','138010','2024-12-03 15:00:00','2025-01-09 15:00:00'),(56,'의류','henry08','남성 청바지','49668','2025-05-16 15:00:00','2025-06-21 15:00:00'),(57,'전자기기','leo12','블루투스 이어폰','12919','2024-12-10 15:00:00','2025-02-07 15:00:00'),(58,'전자기기','brian02','노트북 가방','147605','2025-08-28 15:00:00','2025-09-26 15:00:00'),(59,'의류','sofia19','겨울 패딩','30798','2025-02-05 15:00:00','2025-02-24 15:00:00'),(60,'주방용품','elena05','프라이팬 세트','10079','2025-02-28 15:00:00',NULL),(61,'전자기기','sofia19','블루투스 이어폰','112967','2025-03-17 15:00:00','2025-05-31 15:00:00'),(62,'전자기기','olivia15','노트북 가방','80360','2024-12-18 15:00:00',NULL),(63,'주방용품','noah14','커피 드리퍼','16378','2025-11-29 15:00:00',NULL),(64,'주방용품','queen17','식기 세트','21448','2024-12-02 15:00:00',NULL),(65,'가구','irene09','서랍장','37932','2024-12-09 15:00:00','2025-02-23 15:00:00'),(66,'생활용품','queen17','욕실 수납장','100819','2025-01-30 15:00:00','2025-03-10 15:00:00'),(67,'생활용품','ryan18','수납함 세트','137386','2025-03-11 15:00:00','2025-03-28 15:00:00'),(68,'전자기기','queen17','USB 충전기','86399','2024-10-22 15:00:00','2024-11-06 15:00:00'),(69,'생활용품','leo12','욕실 수납장','106439','2025-02-16 15:00:00',NULL),(70,'주방용품','sofia19','커피 드리퍼','45006','2025-03-13 15:00:00','2025-06-04 15:00:00'),(71,'가전제품','carol03','헤어드라이기','23235','2024-11-10 15:00:00','2024-11-23 15:00:00'),(72,'생활용품','queen17','욕실 수납장','146924','2025-01-06 15:00:00','2025-02-19 15:00:00'),(73,'전자기기','olivia15','노트북 가방','38253','2024-10-22 15:00:00','2024-10-27 15:00:00'),(74,'의류','alice01','운동화','118326','2024-12-27 15:00:00','2025-01-15 15:00:00'),(75,'전자기기','felix06','블루투스 이어폰','73841','2024-09-12 15:00:00',NULL),(76,'의류','alice01','운동화','119361','2024-08-15 15:00:00',NULL),(77,'가전제품','noah14','헤어드라이기','100917','2025-11-15 15:00:00',NULL),(78,'가구','ryan18','접이식 의자','94367','2025-03-11 15:00:00','2025-05-24 15:00:00'),(79,'주방용품','queen17','프라이팬 세트','90583','2024-11-27 15:00:00',NULL),(80,'전자기기','derek04','블루투스 이어폰','145764','2025-02-02 15:00:00','2025-02-20 15:00:00'),(81,'의류','alice01','겨울 패딩','23779','2024-08-03 15:00:00',NULL),(82,'전자기기','brian02','노트북 가방','117628','2025-08-03 15:00:00',NULL),(83,'의류','jack10','남성 청바지','147392','2025-11-02 15:00:00','2025-11-21 15:00:00'),(84,'가구','peter16','접이식 의자','42717','2025-03-15 15:00:00','2025-06-03 15:00:00'),(85,'생활용품','jack10','욕실 수납장','48351','2025-11-28 15:00:00','2026-02-20 15:00:00'),(86,'주방용품','ryan18','세라믹 냄비','101961','2025-03-01 15:00:00','2025-03-07 15:00:00'),(87,'주방용품','olivia15','세라믹 냄비','122577','2024-11-17 15:00:00',NULL),(88,'가전제품','sofia19','스팀다리미','119802','2025-01-20 15:00:00',NULL),(89,'가구','leo12','원목 책상','131777','2025-04-03 15:00:00','2025-05-28 15:00:00'),(90,'전자기기','felix06','노트북 가방','30473','2025-01-01 15:00:00',NULL),(91,'주방용품','carol03','세라믹 냄비','27109','2024-09-10 15:00:00','2024-11-11 15:00:00'),(92,'전자기기','brian02','USB 충전기','87682','2025-08-05 15:00:00','2025-09-28 15:00:00'),(93,'가구','ryan18','원목 책상','137641','2025-01-05 15:00:00',NULL),(94,'가구','ryan18','원목 책상','67037','2025-01-19 15:00:00',NULL),(95,'가전제품','brian02','스팀다리미','88153','2025-06-25 15:00:00',NULL),(96,'생활용품','elena05','욕실 수납장','52770','2024-12-09 15:00:00','2025-02-22 15:00:00'),(97,'생활용품','leo12','공기청정기 필터','120141','2024-11-16 15:00:00','2024-12-25 15:00:00'),(98,'의류','carol03','남성 청바지','10609','2024-09-21 15:00:00',NULL),(99,'가전제품','felix06','헤어드라이기','11496','2024-11-02 15:00:00',NULL),(100,'주방용품','tom20','식기 세트','33044','2025-03-06 15:00:00','2025-03-14 15:00:00');
/*!40000 ALTER TABLE `test_products` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-08-11 15:01:27
